Revit 2026 API

# ViewDiscipline Enumeration

---

Discipline of the view

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewDiscipline
```
```vb
Public Enumeration ViewDiscipline
```
```cpp
public enum class ViewDiscipline
```
```fsharp
type ViewDiscipline
```

| Member name | Value | Description |
| --- | --- | --- |
| Architectural | 1 | Architectural |
| Coordination | 4,095 | Coordination |
| Electrical | 8 | Electrical |
| Mechanical | 4 | Mechanical |
| Plumbing | 16 | Plumbing |
| Structural | 2 | Structural |

#### Reference

Autodesk.Revit.DB Namespace